
INPUT_PROMPT = {
"NLI": 
"""前提：{}
假设：{}

答案：""",


"SENTIMENT_2":
"""文本：{}

答案：""",

"smp2020-ewect":
"""文本：{}

答案：""",


'ASAP_ASPECT':
"""评论：{}
评价对象：{}

答案：""",

'bdci2018':
"""汽车评论：{}
评价维度：{}

答案：""",

"nlpcc-stance":
"""微博文本：{}
评论对象：{}

答案：""",

"DuReader_yseorno":
"""问题：{}
回答：{}

答案：""",

"ReCO":
"""背景：{}
问题：{}
选项：{}

答案：""",

"lcqmc":
"""问题1：{}
问题2：{}

答案：""",

"afqmc":
"""文本1：{}
文本2：{}

答案：""",

"paws":
"""文本1：{}
文本2：{}

答案：""",

"bustm":
"""问题1：{}
问题2：{}

答案：""",

"qbqtc":
"""查询1：{}
查询2：{}

答案：""",

"cluewsc2020":
"""文本：{}
名词：{}

答案：""",

"cluener":
"""文本：{}

答案：""",

"msra_ner":
"""文本：{}

答案：""",

"weibo_ner":
"""文本：{}

答案：""",

"tnews":
"""新闻：{}

答案：""",

"csl":
"""论文标题：{}

答案：""",

"domain_cls":
"""文本：{}

答案：""",



'crisis':
"""博文：{}

答案：""",



"c3":
"""背景：{}

问题：{}
选项：{}

答案：""",

"logiqa":
"""背景：{}
问题：{}
选项：{}

答案：""",

"logiqa2":
"""背景：{}
问题：{}
选项：{}

答案：""",

"MRC":
"""问题：{1}
段落：{0}

答案：""",

"DuReader_checklist":
"""问题：{1}
段落：{0}

答案：""",


"ekar":
"""问题：{}
选项：{}

答案：""",

"morality":
"""文本：{}

答案：""",

'cold':
"""文本：{}
主题：{}

答案：""",

'Chinese-Metaphor-Analysis':
"""文本：{}

答案：""",


"FCGEC":
"""文本：{}

答案：""",

"NaCGEC":
"""文本：{}

答案："""
}


INPUT_PROMPT1 = {
"NLI": 
"""前提：{}
假设：{}""",

"cinlid": 
"""前提：{}
假设：{}""",

"SENTIMENT_2":
"""文本：{}""",

"smp2020-ewect":
"""文本：{}""",

'ASAP_ASPECT':
"""评论：{}
评价对象：{}""",

'bdci2018':
"""汽车评论：{}
评价维度：{}""",

"nlpcc-stance":
"""微博文本：{}
评论对象：{}""",

"DuReader_yseorno":
"""问题：{}
回答：{}""",

"ReCO":
"""背景：{}
问题：{}
选项：{}""",



"lcqmc":
"""问题1：{}
问题2：{}""",

"afqmc":
"""文本1：{}
文本2：{}""",

"paws":
"""文本1：{}
文本2：{}""",

"bustm":
"""问题1：{}
问题2：{}""",

"qbqtc":
"""查询1：{}
查询2：{}""",

"cluewsc2020":
"""文本：{}
给定名词：{}""",

"cluener":
"""文本：{}""",

"msra_ner":
"""文本：{}""",

"weibo_ner":
"""文本：{}""",

"tnews":
"""新闻：{}""",

"csl":
"""论文标题：{}""",

"domain_cls":
"""文本：{}""",

'crisis':
"""博文：{}""",



"c3":
"""背景：{}

问题：{}
选项：{}""",

"logiqa":
"""背景：{}
问题：{}
选项：{}""",

"logiqa2":
"""背景：{}
问题：{}
选项：{}""",

"MRC":
"""问题：{1}
段落：{0}""",

"DuReader_checklist":
"""问题：{1}
段落：{0}""",


"ekar":
"""问题：{}
选项：{}""",

"morality":
"""文本：{}""",

'cold':
"""文本：{}
主题：{}""",

'Chinese-Metaphor-Analysis':
"""文本：{}""",


"FCGEC":
"""文本：{}""",

"NaCGEC":
"""文本：{}"""
}



INPUT_PROMPT2 = {
"NLI": 
"""关系：""",

"cinlid": 
"""关系：""",

"SENTIMENT_2":
"""情感倾向：""",

"smp2020-ewect":
"""情绪：""",

'ASAP_ASPECT':
"""情感倾向：""",

'bdci2018':
"""情感倾向：""",

"nlpcc-stance":
"""立场：""",

"DuReader_yseorno":
"""观点极性：""",

"ReCO":
"""观点：""",

"lcqmc":
"""语义关系：""",

"afqmc":
"""语义关系：""",

"paws":
"""语义关系：""",

"bustm":
"""语义关系：""",

"qbqtc":
"""相关性：""",

"cluewsc2020":
"""指代关系：""",

"cluener":
"""实体及对应类别：""",

"msra_ner":
"""实体及对应类别：""",

"weibo_ner":
"""实体及对应类别：""",

"tnews":
"""类别：""",

"csl":
"""学科：""",

"domain_cls":
"""领域：""",

'crisis':
"""信息：""",


"c3":
"""答案：""",

"logiqa":
"""答案：""",

"logiqa2":
"""答案：""",

"MRC":
"""答案：""",

"DuReader_checklist":
"""答案：""",


"ekar":
"""答案：""",

"morality":
"""道德：""",

'cold':
"""歧视：""",

"chid":
"""答案：""",

'Chinese-Metaphor-Analysis':
"""隐喻：""",


"FCGEC":
"""语法错误：""",

"NaCGEC":
"""语法错误："""
}