SYSTEM = {
    "NLI": """你是一个完成自然语言推理任务的专家。""",

    "SENTIMENT_2": """你是一个完成情感二分类任务的专家。""",
    "smp2020-ewect": """你是一个完成微博情绪六分类任务的专家。""",
    "nlpcc-stance": """你是一个完成微博文本立场判别任务的专家。""",

    "ASAP_ASPECT":"""你是一个完成评价对象级情感三分类任务的专家。""",
    "bdci2018":"""你是一个完成汽车评论情感三分类任务的专家。""",

    "lcqmc":"""你是一个完成问题对匹配任务的专家。""",
    "afqmc":"""你是一个完成文本语义相似判别任务的专家。""",
    "paws":"""你是一个完成文本对语义关系匹配任务的专家。""",
    "bustm":"""你是一个完成问题对语义关系匹配任务的专家。""",
    'qbqtc':"""你是一个完成查询对相关性判别任务的专家。""",

    "cluewsc2020":"""你是一个完成代词指代消歧任务的专家。""",

    'cluener':"""你是一个完成命名实体识别任务的专家。""",
    'msra_ner':"""你是一个完成命名实体识别任务的专家。""",
    'weibo_ner':"""你是一个完成命名实体识别任务的专家。""",

    'tnews':"""你是一个完成新闻短文本分类任务的专家。""",
    'Chinese-Metaphor-Analysis':"""你是一个完成中文动名词隐喻识别任务的专家。""",
    'crisis':"""你是一个完成应急救援信息量判别任务的专家。""",
    'domain_cls':"""你是一个完成文本领域判别任务的专家。""",
    'morality':"""你是一个完成中文文本道德判别任务的专家。""",
    'cold':"""你是一个完成中文文本歧视判别任务的专家。""",
    'csl':"""你是一个完成论文标题学科分类任务的专家。""",



    'c3': """你是一个完成多项选择式阅读理解任务的专家。""",
    'logiqa':"""你是一个完成逻辑问答领域多项选择式阅读理解任务的专家。""",
    'logiqa2':"""你是一个完成逻辑问答领域多项选择式阅读理解任务的专家。""",

    'MRC':"""你是一个完成片段抽取式阅读理解任务的专家。""",
    "DuReader_checklist":"""你是一个完成片段抽取式阅读理解任务的专家。""",
    "DuReader_yseorno":"""你是一个完成观点极性判断阅读理解任务的专家。""",
    'ReCO':"""你是一个完成观点判别阅读理解任务的专家""",
    'ekar':"""你是一个完成词语类比识别任务的专家。""",

    'FCGEC':"""你是一个完成中文语法检错任务的专家。""",
    'NaCGEC':"""你是一个完成中文语法检错任务的专家。"""
}

